Revit 2024 API
PointCloudOverrideSettings Class
 The graphic override settings for one PointCloudInstance element or one of its scans.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class PointCloudOverrideSettings : IDisposable
Visual Basic
Public Class PointCloudOverrideSettings _
	Implements IDisposable
Visual C++
public ref class PointCloudOverrideSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
See Also
PointCloudOverrideSettings Members
Autodesk.Revit.DB.PointClouds Namespace